# thoughtbot package which sym links dotfiles
tap 'thoughtbot/formulae'
brew 'rcm'

# use zsh instead of bash: https://www.quora.com/What-is-the-difference-between-bash-and-zsh
brew 'zsh'

# neovim is asynchronous and more actively maintained than vim
brew 'neovim'

# i need these
brew 'node'

# i like these
brew 'the_silver_searcher'
brew 'wget'
brew 'tmux'

# asdf deps: https://github.com/asdf-vm/asdf/blob/master/README.md
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
