# thoughtbot package which sym links dotfiles
tap 'thoughtbot/formulae'
brew 'rcm'

# use zsh instead of bash: https://www.quora.com/What-is-the-difference-between-bash-and-zsh
brew 'zsh'

# neovim is asynchronous and more actively maintained than vim
brew 'neovim'

# create pull requests on github from the command line
brew 'hub'

# i need these
brew 'yarn'

# i like these
brew 'the_silver_searcher'
brew 'wget'
brew 'tmux'
brew 'heroku'

# acceptance testing react-native apps: https://github.com/wix/detox
tap 'facebook/fb'
brew 'fbsimctl', args: ['--HEAD']
tap 'wix/brew'
brew 'applesimutils'

# asdf deps: https://github.com/asdf-vm/asdf/blob/master/README.md
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
